app/views/pages/dashboard_user.html.erb


<% @user.profile.achievements.each do |achievement|  %>
---
SELECT `achievements`.* FROM `achievements` INNER JOIN `achievements_profiles` ON `achievements`.`id` = `achievements_profiles`.`achievement_id` WHERE `achievements_profiles`.`profile_id` = 3
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 3 LIMIT 1