app/views/museums/show.html.erb


	<% @museum.exhibits.each do |exhibit| %>
---
SELECT `exhibits`.* FROM `exhibits` WHERE `exhibits`.`museum_id` = 1