app/controllers/achievements_controller.rb

  def index
    @achievements = Achievement.all
---
SELECT `achievements`.* FROM `achievements`