app/controllers/museums_controller.rb

  def index
    @museums = Museum.all
---
SELECT `museums`.* FROM `museums`

  def show
    @museum = Museum.find(params[:id])
---
SELECT `museums`.* FROM `museums` WHERE `museums`.`id` = 1 LIMIT 1