app/controllers/pages_controller.rb

SELECT `scans`.* FROM `scans`
SELECT `exhibits`.* FROM `exhibits` ORDER BY `exhibits`.`id` DESC LIMIT 1
---
  def index
    if user_signed_in?

      @user = current_user
      if @user.admin?
        render 'dashboard_admin', layout: 'simple'
        return
      elsif @user.manager?
        @museum = Museum.all
        render 'dashboard_manager', layout: 'simple'
        return
      else
        @scans = Scan.all
        @scan_prof = []
        @scans.each do |s|
          @scan_prof << s if s.profile_id == @user.profile.id
        end
        @exhibit = Exhibit.last

SELECT `users`.* FROM `users`
---
  def users_reset
    @user = User.all