app/controllers/profiles_controller.rb

SELECT `profiles`.* FROM `profiles`
---
  def index
    @profiles = Profile.all